lib/assets/registerVerification_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dyn="http://dynamicform.services.registrations.edentiti.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <dyn:registerVerification>
         <accountId>CUSTOMER_ID</accountId>
         <password>PASSWORD</password>
         <ruleId>default</ruleId>
         <name>
            <givenName>Test</givenName>
            <middleNames>Harold</middleNames>
            <surname>McTester</surname>
         </name>
         <email>test@example.com</email>
         <currentResidentialAddress>
            <streetName>Macquarie</streetName>
		      <streetNumber>1</streetNumber>
		      <streetType>ST</streetType>
            <suburb>Sydney</suburb>
            <state>NSW</state>
		      <postcode>2000</postcode>
            <country>AUS</country>
         </currentResidentialAddress>
         <dob>
            <day>1</day>
            <month>1</month>
            <year>1980</year>
         </dob>     
         <generateVerificationToken>true</generateVerificationToken>  
       </dyn:registerVerification>
   </soapenv:Body>
</soapenv:Envelope>